B2BGITVersion/BookingAPIFiles/RoomDeletedWithConnectedBooking.xml

<soapenv:Envelope xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/" xmlns = "http://www.juniper.es/webservice/2007/">
  <soapenv:Header/>
  <soapenv:Body>
    <HotelModify>
      <HotelModifyRQ Version = "1.1" Language = "en">
        <Login Email="user@mydomain.com" Password="pass"/>
        <ReservationLocator ItemId = "435091">2LRMPV</ReservationLocator>
        <RelPaxesDist>
          <RelPaxDist>
            <Rooms>
              <Room Code = "5" Source = "2"/>
            </Rooms>
          </RelPaxDist>
        </RelPaxesDist>
      </HotelModifyRQ>
    </HotelModify>
  </soapenv:Body>
</soapenv:Envelope>
